snlkuharlocal/src/Documents/СверкаДанных/СверкаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаДанных</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеИст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеТек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеЦБ</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПБ</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/СверкаДанных/ManagerModule.bsl
// возвращает таблицу данных документа для сравнения
Функция ПолучитьДанныеДляСверкиДокументов(ВидДокумента, Дата1, Дата2, Подразделение) Экспорт
	
	Попытка	
		ТекстЗапроса = Документы[ВидДокумента].ПолучитьТекстЗапросаДляСверки();
	Исключение
		ТекстЗапроса = "";
	КонецПопытки;	
	
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Ссылка,
		|	Номер,
		|	Дата,
		|	Проведен,
		|	#СтрокаРеквизитов#
		|ИЗ
		|	Документ.#ИмяДокумента# КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ТаблицаДокумента.Подразделение В (&Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СтрокаРеквизитов#",	Документы[ВидДокумента].ПолучитьРеквизитыДляСверки());
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяДокумента#",		ВидДокумента);
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	Запрос.УстановитьПараметр("Дата1",			Дата1);
	Запрос.УстановитьПараметр("Дата2",			Дата2);
	
	ТД = Запрос.Выполнить().Выгрузить();
	
	ТД.Колонки.Ссылка.Имя = "Ссылка_";	
	ТД.Колонки.Добавить("Ссылка");
	Для Каждого СтрокаТД Из ТД Цикл
		СтрокаТД.Ссылка = Новый Структура("Вид,Ссылка","Документ."+ВидДокумента, СтрокаТД.Ссылка_.УникальныйИдентификатор());	
	КонецЦикла;
	
	ТД.Колонки.Удалить(ТД.Колонки.Ссылка_);
	
	Возврат ТД;
	
КонецФункции

//Функция СравнитьДанныеПоДокументуСверки(ДокСверки) Экспорт
//	ПараметрыСравнения	= ПараметрыСравнения();	
//	Результаты			= Новый Соответствие;
//	
//	УзелПодразделения	= ПланыОбмена.ОбменСТЦ.НайтиПоРеквизиту("Подразделение",ДокСверки.Подразделение);
//	
//	Для Каждого СтрокаТЧ Из ДокСверки.Данные Цикл
//		Вариант		= СтрШаблон("%1.%2",СтрокаТЧ.ТипОбъекта,СтрокаТЧ.ТипДанных);
//		мПараметры	= ПараметрыСравнения.Получить(Вариант);
//		Если мПараметры<>Неопределено Тогда			
//			Измерения			= СтрРазделить(мПараметры.Измерения,",");
//			ИменаРесурсов		= мПараметры.Ресурсы; //так надо 
//			Ресурсы				= Новый Массив;
//			
//			СсылочныеКолонки	= Измерения;  			
//			
//			ДанныеТек			= ПрочитатьДанные(СтрокаТЧ.ДанныеТек,СсылочныеКолонки,"ПБ");
//			ДанныеИст			= ПрочитатьДанные(СтрокаТЧ.ДанныеИст,СсылочныеКолонки,"ЦБ");
//			
//			МетаОбъект			= Метаданные.НайтиПоПолномуИмени(СтрокаТЧ.ТипОбъекта);			
//			
//			Суффиксы	= Новый Массив;			
//			Если Метаданные.РегистрыНакопления.Содержит(МетаОбъект) Тогда
//				Если СтрокаТЧ.ТипДанных="Остатки" Тогда				
//					Суффиксы.Добавить("НачальныйОстаток");
//					Суффиксы.Добавить("КонечныйОстаток");
//				Иначе
//					Суффиксы.Добавить("Оборот");					
//				КонецЕсли;
//			КонецЕсли;
//			
//			СтрСуффиксы	= СтрСоединить(Суффиксы,",");
//			
//			Суффиксы	= СтрРазделить(СтрСуффиксы,",");
//			
//			Для Каждого Ресурс Из СтрРазделить(ИменаРесурсов,",") Цикл
//				Для Каждого Суффикс Из Суффиксы Цикл
//					Ресурсы.Добавить(СтрШаблон("%1%2",Ресурс,Суффикс));
//				КонецЦикла;
//			КонецЦикла;			
//			
//			Если ДанныеИст=Неопределено И ДанныеТек=Неопределено Тогда
//				Сообщить(СтрШаблон("Не заполннены данные сравнения по варианту: %1",Вариант));
//				Продолжить;
//			Иначе
//				Если ДанныеИст=Неопределено Тогда
//					ДанныеИст	= ДанныеТек.СКопироватьКолонки();
//				Иначе
//					ДанныеТек	= ДанныеИст.СКопироватьКолонки();
//				КонецЕсли;					
//			КонецЕсли; 
//			
//			Запрос	= Новый Запрос;
//			Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
//			Запрос.Текст="
//			|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ДанныеПБ ИЗ &ДанныеПБ КАК ДанныеПБ
//			|;
//			|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ДанныеЦБ ИЗ &ДанныеЦБ КАК ДанныеЦБ
//			|;
//			|"+СоздатьТекстЗапросаСравнения(Измерения,Ресурсы)+"
//			|";
//			
//			Запрос.УстановитьПараметр("ДанныеПБ",ДанныеПБ);
//			Запрос.УстановитьПараметр("ДанныеЦБ",ДанныеЦБ);
//			
//			Результат = Запрос.Выполнить();
//			
//			Заголовок	= СтрШаблон("Сравнение данных. %1.%2. Подразделение: %3. Период: %4.",
//				СтрокаТЧ.ТипОбъекта,СтрокаТЧ.ТипДанных,ДокСверки.Подразделение,ПредставлениеПериода(ДокСверки.Дата1,КонецДня(ДокСверки.Дата2),"ФП=Истина"));			
//						
//			КодЦБ	= ОбщегоНазначения_ПИ.УзелЦБ().Код;
//			Если ОбщегоНазначения_ПИ.ЭтоЦентальныйУзел() Тогда				
//				КодПБ	= УзелПодразделения.Код;
//			Иначе
//				КодПБ	= ОбщегоНазначения_ПИ.КодТекущегоУзла();				
//			КонецЕсли; 
//			
//			ДопПараметры			= Новый Структура("Заголовок,ПредставлениеИсточников",Заголовок,Новый Структура("ЦБ,ПБ",КодЦБ,КодПБ));
//			
//			Результаты.Вставить(Вариант,ВывестиСравнениеНов(Результат,Измерения,Ресурсы,ДопПараметры));
//		КонецЕсли;		
//	КонецЦикла;	
//	
//	Возврат Результаты;
//КонецФункции // ()
// 
//Функция ПрочитатьДанные(ХЗ,СсылочныеКолонки,Суффикс)
//	КэшМенеджеров		= Новый Соответствие;
//	
//	Данные				= Неопределено;
//	
//	Если ТипЗнч(ХЗ)=Тип("ХранилищеЗначения") Тогда
//		Данные	= ХЗ.Получить();
//		Если ТипЗнч(Данные)=Тип("ТаблицаЗначений") И Данные.Количество()>0 Тогда
//			
//			ДобавляемыеКолонки	= Новый Структура;
//			ИзменяемыеКолонки	= Новый Структура;
//				
//			Для Каждого Колонка Из Данные.Колонки Цикл
//				Если СсылочныеКолонки.Найти(Колонка.Имя)=Неопределено Тогда						
//					ИзменяемыеКолонки.Вставить(Колонка.Имя,Колонка.Имя+Суффикс);	
//					ДобавляемыеКолонки.Вставить(Колонка.Имя+?(Суффикс="Ист","Тек","Ист"),ТипыБезNULL(Данные.Колонки[Колонка.Имя].ТипЗначения));
//				КонецЕсли;			
//			КонецЦикла; 
//				
//			Для Каждого ИмяКолонки Из СсылочныеКолонки Цикл
//				Менеджер	= ОбщегоНазначения_ПИ.ПолучитьМенеджер(Данные[0][ИмяКолонки].Вид);
//				КэшМенеджеров.Вставить(ИмяКолонки,Менеджер);			
//					
//				МТ 	= Новый Массив;МТ.Добавить(ТипЗнч(Менеджер.ПустаяСсылка()));				
//				Данные.Колонки.Добавить(ИмяКолонки+"Ссылка",Новый ОписаниеТипов(МТ));					
//			КонецЦикла;
//				
//			Для Каждого ДопКолонка Из ДобавляемыеКолонки Цикл
//				Данные.Колонки.Добавить(ДопКолонка.Ключ,ДопКолонка.Значение);			
//			КонецЦикла;			
//				
//			Для Каждого ДопКолонка Из ИзменяемыеКолонки Цикл
//				Данные.Колонки[ДопКолонка.Ключ].Имя=ДопКолонка.Значение;			
//			КонецЦикла;			
//			
//			Для Каждого СтрокаТЧ Из Данные Цикл
//				Для Каждого ИмяКолонки Из СсылочныеКолонки Цикл
//					СтрокаТЧ[ИмяКолонки+"Ссылка"]=КэшМенеджеров[ИмяКолонки].ПолучитьСсылку(СтрокаТЧ[ИмяКолонки].Ссылка);
//				КонецЦикла;			
//			КонецЦикла;
//			
//			Для Каждого ИмяКолонки Из СсылочныеКолонки Цикл
//				Данные.Колонки.Удалить(ИмяКолонки);	
//				Данные.Колонки[ИмяКолонки+"Ссылка"].Имя=ИмяКолонки;		
//			КонецЦикла;			
//			
//		Иначе
//			
//			Данные	= Неопределено;
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат Данные;
//КонецФункции //ПрочитатьДанные(ХЗ,ИменаСсылочныхКолонок,Суффикс)

//Функция ТипыБезNULL(ОтИст)
//	МТ	= Новый  Массив;	
//	
//	Для Каждого Тип Из ОтИст.Типы() Цикл
//		Если Тип<>Тип("Null") Тогда
//			МТ.Добавить(Тип);
//		КонецЕсли;	
//	КонецЦикла;
//	
//	Возврат Новый ОписаниеТипов(МТ);
//КонецФункции // ()

//Функция ВывестиСравнениеНов(РезультатСравнения,Измерения,Ресурсы,ДопПараметры)
//	Отбор				= Новый Структура;
//	СКДВывода			= СоздатьСКДСравнения(РезультатСравнения,Измерения,Ресурсы,ДопПараметры);	
//	
//	АдресСКДВывода		= ПоместитьВоВременноеХранилище(СКДВывода);
//	
//	РезультатВывода		= РаботаНадСКД_КС.ВывестиСхемуВТД(СКДВывода,,,Отбор,Новый Структура("РезультатСравнения",РезультатСравнения));
//	
//	РезультатВывода.Вставить("АдресСКДВывода",АдресСКДВывода);
//		
//	Возврат РезультатВывода;
//КонецФункции //ВывестиСравнениеОборотов(Адрес,УИДФормы=Неопределено) Экспорт

//Функция СоздатьСКДСравнения(РезультатЗапроса,Измерения,Ресурсы,ДопПараметры) Экспорт	
//	
//	Заголовок				= ОбщегоНазначения.ПолучитьЗначениеПараметра(ДопПараметры,"Заголовок","");
//	ПредставлениеИсточников	= ОбщегоНазначения.ПолучитьЗначениеПараметра(ДопПараметры,"ПредставлениеИсточников",Новый Соответствие());
//	
//	СхемаКомпоновкиДанных	= Новый СхемаКомпоновкиДанных;
//	
//	ИД=СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
//	ИД.Имя					= "Основной";
//	ИД.ТипИсточникаДанных	= "Local";
//	
//	НД						= СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
//	НД.Имя					= "Сверка";
//	НД.ИмяОбъекта			= "РезультатСравнения";
//	НД.ИсточникДанных		= "Основной";	
//	
//	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
//		Поле 				= НД.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
//		Поле.Поле			= Колонка.Имя;
//		Поле.ПутьКДанным	= Колонка.Имя;
//		Поле.ТипЗначения	= ТипыБезNULL(Колонка.ТипЗначения);		
//	КонецЦикла; 
//	
//	ОписанияПолей			= Новый Массив;	
//	ОписанияГруппировок		= Новый Массив;
//	ОписанияИтогов			= Новый Массив;
//	
//	ВариантНастроек	= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;	
//	
//	ПараметрВывода	= ВариантНастроек.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
//	ПараметрВывода.Значение			= Заголовок;
//	ПараметрВывода.Использование	= Истина;
//	
//	ПараметрВывода	= ВариантНастроек.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
//	ПараметрВывода.Значение			= Истина;
//	ПараметрВывода.Использование	= Истина;
//	
//	ПараметрВывода	= ВариантНастроек.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
//	ПараметрВывода.Значение			= "Зеленый";
//	ПараметрВывода.Использование	= Истина;
//	
//	Группировка	= Неопределено;
//	
//	Для Каждого Измерение Из Измерения Цикл
//		Если Группировка	= Неопределено Тогда
//			Группировка = ВариантНастроек.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//		Иначе			
//			Группировка = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//		КонецЕсли;		
//		
//		Группировка.Использование	= Истина;		
//		
//		Поле		= Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//		Поле.Поле	= Новый ПолеКомпоновкиДанных(Измерение);
//		
//		Если Измерение="Номенклатура" Тогда
//			Поле.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия;								
//		КонецЕсли;	
//		
//		Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));		
//	КонецЦикла; 
//	
//	Для Каждого Ресурс Из Ресурсы Цикл
//		ГруппаПолей			  = ВариантНастроек.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
//		ГруппаПолей.Заголовок = ПредставлениеПоля(Ресурс);
//		Для Каждого Суффикс Из СтрРазделить("Ист,Тек,Дельта",",") Цикл
//			ИмяПоля	= Ресурс+Суффикс;
//			
//	    	ПИ				= СхемаКомпоновкиДанных.ПоляИтога.Добавить();
//			ПИ.Выражение	= "СУММА("+ИмяПоля+")";
//			ПИ.ПутьКДанным	= ИмяПоля;		
//			
//			Поле			= ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//			Поле.Поле		= Новый ПолеКомпоновкиДанных(ИмяПоля);
//			Поле.Заголовок 	= ОбщегоНазначения.ПолучитьЗначениеПараметра(ПредставлениеИсточников,Суффикс,Суффикс);
//		КонецЦикла; 		
//	КонецЦикла; 
//	
//	Возврат СхемаКомпоновкиДанных;	
//КонецФункции

//Функция ПредставлениеПоля(Стр)
//	Части = Новый Массив;
//	
//	Поз	= СтрНайти(Стр,"НачальныйОстаток");
//	Если Поз>0 Тогда
//		Части.Добавить(Лев(Стр,Поз-1));		
//		Части.Добавить("нач. ост.");		
//	КонецЕсли; 
//	
//	Поз	= СтрНайти(Стр,"КонечныйОстаток");
//	Если Поз>0 Тогда
//		Части.Добавить(Лев(Стр,Поз-1));		
//		Части.Добавить("кон. ост.");
//	КонецЕсли;
//	
//	ЧастиКратко	= Новый Массив;
//	Для Каждого Часть Из Части Цикл
//		ЧастиКратко.Добавить(ПредставлениеТермина(Часть));
//	КонецЦикла; 
//	
//	Возврат СтрСоединить(ЧастиКратко," ");
//КонецФункции //ПредставлениеПоля(Стр)

//Функция ПредставлениеТермина(Стр)
//	Соответствие	= Новый Соответствие;
//	Соответствие.Вставить("Количество",		"Кол-во");
//	Соответствие.Вставить("СтоимостьНац",	"Стоим. руб.");
//	Соответствие.Вставить("СуммаВал",		"Сумма. руб.");
//	
//	Результат	= Соответствие.Получить(Стр);
//	
//	Возврат ?(Результат=Неопределено,Стр,Результат);
//КонецФункции // ()

//Функция СоздатьТекстЗапросаСравнения(Измерения,Ресурсы)
//	ПоляРесурсов	= Новый Массив;
//	ПоляГруппировок	= Новый Массив;
//	ПоляИтогов		= Новый Массив;
//	
//	Для Каждого Измерение Из Измерения Цикл
//		ПоляГруппировок.Добавить(Измерение);		
//	КонецЦикла;		
//						
//	Для Каждого Ресурс Из Ресурсы Цикл		
//		ПоляРесурсов.Добавить(Ресурс+"Ист");
//		ПоляРесурсов.Добавить(Ресурс+"Тек");
//		ПоляРесурсов.Добавить(СтрШаблон("%1Ист-%1Тек КАК %1Дельта",Ресурс));		
//		
//		ПоляИтогов.Добавить("СУММА("+Ресурс+"Ист)");
//		ПоляИтогов.Добавить("СУММА("+Ресурс+"Тек)");
//		ПоляИтогов.Добавить("СУММА("+Ресурс+"Дельта)");		
//	КонецЦикла; 
//			
//	СтрРесурсов		=	СтрСоединить(ПоляРесурсов,","+Символы.ПС);
//	СтрГруппировок	=	СтрСоединить(ПоляГруппировок,","+Символы.ПС);
//	СтрИтогов		=	СтрСоединить(ПоляИтогов,","+Символы.ПС);
//			
//	ТекстЗапроса="
//	|ВЫБРАТЬ
//	|	"+СтрГруппировок+",	
//	|	"+СтрИтогов+"
//	|ИЗ
//	|(	
//	|ВЫБРАТЬ
//	|	"+СтрГруппировок+",
//	|	"+СтрРесурсов+"
//	|ИЗ 
//	|	ВТ_ДанныеИст	
//	|ОБЪЕДИНИТЬ ВСЕ
//	|ВЫБРАТЬ
//	|	"+СтрГруппировок+",
//	|	"+СтрРесурсов+"
//	|ИЗ 
//	|	ВТ_ДанныеТек	
//	|) КАК Сводный		
//	|СГРУППИРОВАТЬ ПО 
//	|	"+СтрГруппировок+"	
//	|";	
//	
//	Возврат ТекстЗапроса;

//КонецФункции // ()

//Функция ПараметрыСравнения()
//	Результат  = Новый Соответствие;	
//	
//	Результат.Вставить("РегистрНакопления.ОстаткиТМЦ.Остатки",			Новый Структура("Измерения,Ресурсы","Склад,Номенклатура",		"Количество"));
//	Результат.Вставить("РегистрНакопления.ОстаткиТМЦ.Обороты",			Новый Структура("Измерения,Ресурсы","Склад,Регистратор",		"Количество"));
//	
//	Результат.Вставить("РегистрНакопления.ДенежныеСредства.Остатки",	Новый Структура("Измерения,Ресурсы","БанковскийСчет,Валюта",				"СуммаВал"));
//	Результат.Вставить("РегистрНакопления.ДенежныеСредства.Обороты",	Новый Структура("Измерения,Ресурсы","БанковскийСчет,Валюта,Регистратор",	"СуммаВал"));
//	
//	Возврат Результат;
//КонецФункции // ()
